DataProcessors/Лео_ЗаполнениеРасшифровкиПричиныНеотгрузки/Лео_ЗаполнениеРасшифровкиПричиныНеотгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Лео_ЗаполнениеРасшифровкиПричиныНеотгрузки</name>
  <attributes>
    <name>ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНеотгрузки</name>
    <type>
      <types>CatalogRef.абс_ПричиныНеотгрузки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Неотгружено</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
        <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
        <types>DocumentRef.КорректировкаРеализации</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиВДокументе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаНеотгрузки</name>
      <type>
        <types>CatalogRef.абс_ПричиныНеотгрузки</types>
      </type>
    </attributes>
    <attributes>
      <name>РасшифровкаПричиныНеотгрузки</name>
      <type>
        <types>CatalogRef.Лео_РасшифровкаПричиныНеотгрузки</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПретензии</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПретензии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнестиИзменения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Enums/абс_СтатусыОтгрузки/абс_СтатусыОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыОтгрузки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Подобран</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытаСборка</name>
  </enumValues>
</mdclass:Enum>

DataProcessors/Лео_ЗаполнениеРасшифровкиПричиныНеотгрузки/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ОбновитьТЧ(Команда)
	ОбновитьТчНеотгружено ();	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТчНеотгружено ()
	
	Объект.Неотгружено.Очистить();
	
	СписокДоступныхСтатусов = Новый СписокЗначений;
	СписокДоступныхСтатусов.Добавить(Перечисления.абс_СтатусыОтгрузки.Согласован);
	СписокДоступныхСтатусов.Добавить(Перечисления.абс_СтатусыОтгрузки.КОтгрузке);
	СписокДоступныхСтатусов.Добавить(Перечисления.абс_СтатусыОтгрузки.Отгружен);
    СписокДоступныхСтатусов.Добавить(Перечисления.абс_СтатусыОтгрузки.Ошибка);


	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателяабс_Неотгружено.Ссылка КАК Документ,
		|	ЗаказПокупателяабс_Неотгружено.НомерСтроки КАК НомерСтрокиВДокументе,
		|	ЗаказПокупателяабс_Неотгружено.Номенклатура,
		|	ЗаказПокупателяабс_Неотгружено.СерияНоменклатуры,
		|	ЗаказПокупателяабс_Неотгружено.ЕдиницаИзмерения,
		|	ЗаказПокупателяабс_Неотгружено.ПричинаНеотгрузки,
		|	ЗаказПокупателяабс_Неотгружено.Лео_РасшифровкаПричиныНеотгрузки КАК РасшифровкаПричиныНеотгрузки,
		|	ЗаказПокупателяабс_Неотгружено.НомерПретензии,
		|	ЗаказПокупателяабс_Неотгружено.ДатаПретензии,
		|	ЗаказПокупателяабс_Неотгружено.Комментарий,
		|	ЗаказПокупателяабс_Неотгружено.Количество,
		|	ЗаказПокупателяабс_Неотгружено.Номенклатура.Артикул КАК Артикул,
		|	ЗаказПокупателяабс_Неотгружено.Ссылка.Контрагент
		|ИЗ
		|	Документ.ЗаказПокупателя.абс_Неотгружено КАК ЗаказПокупателяабс_Неотгружено
		|ГДЕ
		|	ЗаказПокупателяабс_Неотгружено.Ссылка.Дата МЕЖДУ &ДатаС И &ДатаПо
		|	И ЗаказПокупателяабс_Неотгружено.Ссылка.Проведен = ИСТИНА
		|	И ЗаказПокупателяабс_Неотгружено.Лео_РасшифровкаПричиныНеотгрузки = ЗНАЧЕНИЕ(Справочник.Лео_РасшифровкаПричиныНеотгрузки.ПустаяСсылка)
		|	И ВЫБОР
		|			КОГДА &ПричинаНеотгрузки = ЗНАЧЕНИЕ(Справочник.абс_ПричиныНеотгрузки.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЗаказПокупателяабс_Неотгружено.ПричинаНеотгрузки = &ПричинаНеотгрузки
		|		КОНЕЦ
		|	И ЗаказПокупателяабс_Неотгружено.Ссылка.абс_Статус В(&СписокДоступныхСтатусов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугабс_Неотгружено.Ссылка,
		|	РеализацияТоваровУслугабс_Неотгружено.НомерСтроки,
		|	РеализацияТоваровУслугабс_Неотгружено.Номенклатура,
		|	РеализацияТоваровУслугабс_Неотгружено.СерияНоменклатуры,
		|	РеализацияТоваровУслугабс_Неотгружено.ЕдиницаИзмерения,
		|	РеализацияТоваровУслугабс_Неотгружено.ПричинаНеотгрузки,
		|	РеализацияТоваровУслугабс_Неотгружено.Лео_РасшифровкаПричиныНеотгрузки,
		|	РеализацияТоваровУслугабс_Неотгружено.НомерПретензии,
		|	РеализацияТоваровУслугабс_Неотгружено.ДатаПретензии,
		|	РеализацияТоваровУслугабс_Неотгружено.Комментарий,
		|	РеализацияТоваровУслугабс_Неотгружено.Количество,
		|	РеализацияТоваровУслугабс_Неотгружено.Номенклатура.Артикул,
		|	РеализацияТоваровУслугабс_Неотгружено.Ссылка.Контрагент
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.абс_Неотгружено КАК РеализацияТоваровУслугабс_Неотгружено
		|ГДЕ
		|	РеализацияТоваровУслугабс_Неотгружено.Ссылка.Дата МЕЖДУ &ДатаС И &ДатаПо
		|	И РеализацияТоваровУслугабс_Неотгружено.Ссылка.Проведен = ИСТИНА
		|	И РеализацияТоваровУслугабс_Неотгружено.Лео_РасшифровкаПричиныНеотгрузки = ЗНАЧЕНИЕ(Справочник.Лео_РасшифровкаПричиныНеотгрузки.ПустаяСсылка)
		|	И ВЫБОР
		|			КОГДА &ПричинаНеотгрузки = ЗНАЧЕНИЕ(Справочник.абс_ПричиныНеотгрузки.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ РеализацияТоваровУслугабс_Неотгружено.ПричинаНеотгрузки = &ПричинаНеотгрузки
		|		КОНЕЦ
		|	И РеализацияТоваровУслугабс_Неотгружено.Ссылка.абс_Статус В(&СписокДоступныхСтатусов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КорректировкаРеализацииТовары.Ссылка,
		|	КорректировкаРеализацииТовары.НомерСтроки,
		|	КорректировкаРеализацииТовары.Номенклатура,
		|	КорректировкаРеализацииТовары.СерияНоменклатуры,
		|	КорректировкаРеализацииТовары.ЕдиницаИзмерения,
		|	КорректировкаРеализацииТовары.абс_ПричинаНеотгрузки,
		|	КорректировкаРеализацииТовары.Лео_РасшифровкаПричиныНеотгрузки,
		|	КорректировкаРеализацииТовары.абс_НомерПретензии,
		|	КорректировкаРеализацииТовары.абс_ДатаПретензии,
		|	КорректировкаРеализацииТовары.абс_Комментарий,
		|	КорректировкаРеализацииТовары.КоличествоДоИзменения - КорректировкаРеализацииТовары.Количество,
		|	КорректировкаРеализацииТовары.Номенклатура.Артикул,
		|	КорректировкаРеализацииТовары.Ссылка.Контрагент
		|ИЗ
		|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
		|ГДЕ
		|	КорректировкаРеализацииТовары.Ссылка.Дата МЕЖДУ &ДатаС И &ДатаПо
		|	И КорректировкаРеализацииТовары.Ссылка.Проведен = ИСТИНА
		|	И КорректировкаРеализацииТовары.Лео_РасшифровкаПричиныНеотгрузки = ЗНАЧЕНИЕ(Справочник.Лео_РасшифровкаПричиныНеотгрузки.ПустаяСсылка)
		|	И ВЫБОР
		|			КОГДА &ПричинаНеотгрузки = ЗНАЧЕНИЕ(Справочник.абс_ПричиныНеотгрузки.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ КорректировкаРеализацииТовары.абс_ПричинаНеотгрузки = &ПричинаНеотгрузки
		|		КОНЕЦ
		|	И НЕ КорректировкаРеализацииТовары.абс_ПричинаНеотгрузки = ЗНАЧЕНИЕ(Справочник.абс_ПричиныНеотгрузки.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВозвратТоваровОтПокупателяТовары.Ссылка,
		|	ВозвратТоваровОтПокупателяТовары.НомерСтроки,
		|	ВозвратТоваровОтПокупателяТовары.Номенклатура,
		|	ВозвратТоваровОтПокупателяТовары.СерияНоменклатуры,
		|	ВозвратТоваровОтПокупателяТовары.ЕдиницаИзмерения,
		|	ВозвратТоваровОтПокупателяТовары.абс_ПричинаНеотгрузки,
		|	ВозвратТоваровОтПокупателяТовары.Лео_РасшифровкаПричиныНеотгрузки,
		|	ВозвратТоваровОтПокупателяТовары.абс_НомерПретензии,
		|	ВозвратТоваровОтПокупателяТовары.абс_ДатаПретензии,
		|	"""",
		|	ВозвратТоваровОтПокупателяТовары.Количество,
		|	ВозвратТоваровОтПокупателяТовары.Номенклатура.Артикул,
		|	ВозвратТоваровОтПокупателяТовары.Ссылка.Контрагент
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
		|ГДЕ
		|	ВозвратТоваровОтПокупателяТовары.Ссылка.Дата МЕЖДУ &ДатаС И &ДатаПо
		|	И ВозвратТоваровОтПокупателяТовары.Ссылка.Проведен = ИСТИНА
		|	И ВозвратТоваровОтПокупателяТовары.Лео_РасшифровкаПричиныНеотгрузки = ЗНАЧЕНИЕ(Справочник.Лео_РасшифровкаПричиныНеотгрузки.ПустаяСсылка)
		|	И ВЫБОР
		|			КОГДА &ПричинаНеотгрузки = ЗНАЧЕНИЕ(Справочник.абс_ПричиныНеотгрузки.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ВозвратТоваровОтПокупателяТовары.абс_ПричинаНеотгрузки = &ПричинаНеотгрузки
		|		КОНЕЦ
		|	И НЕ ВозвратТоваровОтПокупателяТовары.абс_ПричинаНеотгрузки = ЗНАЧЕНИЕ(Справочник.абс_ПричиныНеотгрузки.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоступлениеТоваровУслугТовары.Ссылка,
		|	ПоступлениеТоваровУслугТовары.НомерСтроки,
		|	ПоступлениеТоваровУслугТовары.Номенклатура,
		|	ПоступлениеТоваровУслугТовары.СерияНоменклатуры,
		|	ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения,
		|	ПоступлениеТоваровУслугТовары.абс_ПричинаНеотгрузки,
		|	ПоступлениеТоваровУслугТовары.Лео_РасшифровкаПричиныНеотгрузки,
		|	ПоступлениеТоваровУслугТовары.абс_НомерПретензии,
		|	ПоступлениеТоваровУслугТовары.абс_ДатаПретензии,
		|	ПоступлениеТоваровУслугТовары.Лео_Комментарий,
		|	ПоступлениеТоваровУслугТовары.Количество,
		|	ПоступлениеТоваровУслугТовары.Номенклатура.Артикул,
		|	ПоступлениеТоваровУслугТовары.Ссылка.Контрагент
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|ГДЕ
		|	ПоступлениеТоваровУслугТовары.Ссылка.Дата МЕЖДУ &ДатаС И &ДатаПо
		|	И ПоступлениеТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
		|	И ПоступлениеТоваровУслугТовары.Лео_РасшифровкаПричиныНеотгрузки = ЗНАЧЕНИЕ(Справочник.Лео_РасшифровкаПричиныНеотгрузки.ПустаяСсылка)
		|	И ВЫБОР
		|			КОГДА &ПричинаНеотгрузки = ЗНАЧЕНИЕ(Справочник.абс_ПричиныНеотгрузки.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ПоступлениеТоваровУслугТовары.абс_ПричинаНеотгрузки = &ПричинаНеотгрузки
		|		КОНЕЦ
		|	И НЕ ПоступлениеТоваровУслугТовары.абс_ПричинаНеотгрузки = ЗНАЧЕНИЕ(Справочник.абс_ПричиныНеотгрузки.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Документ,
		|	Артикул";

	Запрос.УстановитьПараметр("ДатаПо", Объект.ДатаПо);
	Запрос.УстановитьПараметр("ДатаС", Объект.ДатаС);
	Запрос.УстановитьПараметр("ПричинаНеотгрузки", Объект.ПричинаНеотгрузки);
	Запрос.УстановитьПараметр("СписокДоступныхСтатусов", СписокДоступныхСтатусов);

	Результат = Запрос.Выполнить();
    ТзНеотгружено  = Результат.Выгрузить();
	Объект.Неотгружено.Загрузить(ТзНеотгружено);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВнестиИзмененияВДокументы(Команда)
	ВнестиИзмененияВДокументыНаСервере ();	
КонецПроцедуры

&НаСервере
Процедура  ВнестиИзмененияВДокументыНаСервере ()
	
	СписокДокументов  = Объект.Неотгружено.Выгрузить(,"Документ,ВнестиИзменения ");	
	СписокДокументов.Свернуть("Документ","ВнестиИзменения");
	
	Для каждого СтрокаДокументы из СписокДокументов Цикл
		
		Если СтрокаДокументы.ВнестиИзменения Тогда
			ДокументСсылка = СтрокаДокументы.Документ;
			ПараметрыОтбораСтрок = Новый Структура;
			ПараметрыОтбораСтрок.Вставить("Документ",ДокументСсылка);
			СтрокиДокумента = Объект.Неотгружено.Выгрузить(ПараметрыОтбораСтрок,);	
			
			ТипИсточника = ТипЗнч(ДокументСсылка);
			Если ТипИсточника = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				
				ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
                ТчНеотгружено = ДокументОбъект.абс_Неотгружено;
				Для каждого СтрокаДок из СтрокиДокумента Цикл
					ИскомаяСтрока = ТчНеотгружено.Получить(СтрокаДок.НомерСтрокиВДокументе - 1);	
					//Проверка что не ошиблись с номером строки
					Если ИскомаяСтрока.Номенклатура = СтрокаДок.Номенклатура и
					ИскомаяСтрока.Количество = СтрокаДок.Количество и
					ИскомаяСтрока.ПричинаНеотгрузки = СтрокаДок.ПричинаНеотгрузки Тогда
						 ИскомаяСтрока.Лео_РасшифровкаПричиныНеотгрузки = СтрокаДок.РасшифровкаПричиныНеотгрузки;
						 ИскомаяСтрока.Лео_ОтветственныйЗаРасшифровку = СтрокаДок.Ответственный;
					Иначе	 
						 Сообщить("Не найдена строка документа с ключевыми параметрами.");
					КонецЕсли	
				КонецЦикла;
				Попытка
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, );
				Исключение
					Сообщить("Не удалось провести документ");
					Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);		
				КонецПопытки;
				
			ИначеЕсли ТипИсточника = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
				
				ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
                ТчНеотгружено = ДокументОбъект.абс_Неотгружено;
				Для каждого СтрокаДок из СтрокиДокумента Цикл
					ИскомаяСтрока = ТчНеотгружено.Получить(СтрокаДок.НомерСтрокиВДокументе - 1);	
					//Проверка что не ошиблись с номером строки
					Если ИскомаяСтрока.Номенклатура = СтрокаДок.Номенклатура и
					ИскомаяСтрока.Количество = СтрокаДок.Количество и
					ИскомаяСтрока.ПричинаНеотгрузки = СтрокаДок.ПричинаНеотгрузки Тогда
						 ИскомаяСтрока.Лео_РасшифровкаПричиныНеотгрузки = СтрокаДок.РасшифровкаПричиныНеотгрузки;
						 ИскомаяСтрока.Лео_ОтветственныйЗаРасшифровку = СтрокаДок.Ответственный;
					Иначе	 
						 Сообщить("Не найдена строка документа с ключевыми параметрами.");
					КонецЕсли	
				КонецЦикла;
				Попытка
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, );
				Исключение
					Сообщить("Не удалось провести документ");
					Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);		
				КонецПопытки;
				
			ИначеЕсли ТипИсточника = Тип("ДокументОбъект.КорректировкаРеализации") Тогда
				
				ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
                ТчНеотгружено = ДокументОбъект.Товары;
				Для каждого СтрокаДок из СтрокиДокумента Цикл
					ИскомаяСтрока = ТчНеотгружено.Получить(СтрокаДок.НомерСтрокиВДокументе - 1);	
					//Проверка что не ошиблись с номером строки
					Если ИскомаяСтрока.Номенклатура = СтрокаДок.Номенклатура и
					ИскомаяСтрока.абс_ПричинаНеотгрузки = СтрокаДок.ПричинаНеотгрузки Тогда
						 ИскомаяСтрока.Лео_РасшифровкаПричиныНеотгрузки = СтрокаДок.РасшифровкаПричиныНеотгрузки;
						 ИскомаяСтрока.Лео_ОтветственныйЗаРасшифровку = СтрокаДок.Ответственный;
					Иначе	 
						 Сообщить("Не найдена строка документа с ключевыми параметрами.");
					КонецЕсли	
				КонецЦикла;
				Попытка
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, );
				Исключение
					Сообщить("Не удалось провести документ");
					Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);		
				КонецПопытки;

			ИначеЕсли ТипИсточника = Тип("ДокументОбъект.ВозвратТоваровОтПокупателя") Тогда
				
				ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
                ТчНеотгружено = ДокументОбъект.Товары;
				Для каждого СтрокаДок из СтрокиДокумента Цикл
					ИскомаяСтрока = ТчНеотгружено.Получить(СтрокаДок.НомерСтрокиВДокументе - 1);	
					//Проверка что не ошиблись с номером строки
					Если ИскомаяСтрока.Номенклатура = СтрокаДок.Номенклатура и
					ИскомаяСтрока.абс_ПричинаНеотгрузки = СтрокаДок.ПричинаНеотгрузки Тогда
						 ИскомаяСтрока.Лео_РасшифровкаПричиныНеотгрузки = СтрокаДок.РасшифровкаПричиныНеотгрузки;
						 ИскомаяСтрока.Лео_ОтветственныйЗаРасшифровку = СтрокаДок.Ответственный;
					Иначе	 
						 Сообщить("Не найдена строка документа с ключевыми параметрами.");
					КонецЕсли	
				КонецЦикла;
				Попытка
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, );
				Исключение
					Сообщить("Не удалось провести документ");
					Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);		
				КонецПопытки;	
				
			ИначеЕсли ТипИсточника = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Тогда
				
				ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
                ТчНеотгружено = ДокументОбъект.Товары;
				Для каждого СтрокаДок из СтрокиДокумента Цикл
					ИскомаяСтрока = ТчНеотгружено.Получить(СтрокаДок.НомерСтрокиВДокументе - 1);	
					//Проверка что не ошиблись с номером строки
					Если ИскомаяСтрока.Номенклатура = СтрокаДок.Номенклатура и
					ИскомаяСтрока.абс_ПричинаНеотгрузки = СтрокаДок.ПричинаНеотгрузки Тогда
						 ИскомаяСтрока.Лео_РасшифровкаПричиныНеотгрузки = СтрокаДок.РасшифровкаПричиныНеотгрузки;
						 ИскомаяСтрока.Лео_ОтветственныйЗаРасшифровку = СтрокаДок.Ответственный;
					Иначе	 
						 Сообщить("Не найдена строка документа с ключевыми параметрами.");
					КонецЕсли	
				КонецЦикла;
				Попытка
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, );
				Исключение
					Сообщить("Не удалось провести документ");
					Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);		
				КонецПопытки;
				
				
			Иначе
				Возврат;
			КонецЕсли;

		КонецЕсли;			
	КонецЦикла;
	
КонецПроцедуры	


&НаКлиенте
Процедура НеотгруженоРасшифровкаПричиныНеотгрузкиПриИзменении(Элемент)
	
	Элементы.Неотгружено.ТекущиеДанные.ВнестиИзменения = Истина;	
	Элементы.Неотгружено.ТекущиеДанные.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Объект.ДатаС = НачалоМесяца(ТекущаяДата());
	Объект.ДатаПо= КонецМесяца(ТекущаяДата());
	ОбновитьТчНеотгружено ();
	
КонецПроцедуры
